In [2]:
# Importing Dataset
dir = '../Machine Learning A-Z (Codes and Datasets)/Part 2 - Regression/Section 6 - Polynomial Regression/R/Position_Salaries.csv'
dataset = read.csv(dir)

In [3]:
dataset

   Position          Level Salary
1  Business Analyst   1      45000
2  Junior Consultant  2      50000
3  Senior Consultant  3      60000
4  Manager            4      80000
5  Country Manager    5     110000
6  Region Manager     6     150000
7  Partner            7     200000
8  Senior Partner     8     300000
9  C-level            9     500000
10 CEO               10    1000000

In [9]:
dataset$Country

 [1] France  Spain   Germany Spain   Germany France  Spain   France  Germany
[10] France
Levels: France Germany Spain

In [34]:
dataset$Country = factor(dataset$Country,
                        levels = c('France', 'Spain', 'Germany'),
                        labels = c( 1, 2, 3))

In [35]:
dataset$Purchased = factor(dataset$Purchased,
                        levels = c('Yes', 'No'),
                        labels = c( 1, 2))

In [37]:
dataset

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 2
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 2
4  2       38.00000 61000.00 2
5  3       40.00000 63777.78 1
6  1       35.00000 58000.00 1
7  2       38.77778 52000.00 2
8  1       48.00000 79000.00 1
9  3       50.00000 83000.00 2
10 1       37.00000 67000.00 1

In [38]:
#SPLITTING THE DATA
install.packages("caTools")

also installing the dependency ‘bitops’

Updating HTML index of packages in '.Library'
Making 'packages.html' ... done

In [40]:
library('caTools')
set.seed(123)

In [48]:
split = sample.split(dataset$Purchased, SplitRatio=0.8 )
training_set = subset(dataset, split == TRUE)
test_set = subset(dataset, split==FALSE)

In [49]:
training_set

  Country Age      Salary   Purchased
1 1       44.00000 72000.00 2
2 2       27.00000 48000.00 1
4 2       38.00000 61000.00 2
5 3       40.00000 63777.78 1
6 1       35.00000 58000.00 1
7 2       38.77778 52000.00 2
8 1       48.00000 79000.00 1
9 3       50.00000 83000.00 2

In [50]:
test_set

   Country Age Salary Purchased
3  3       30  54000  2
10 1       37  67000  1

In [57]:
#Feature Scaling
training_set[,2:3] = scale(training_set[,2:3])
test_set[,2:3] = scale(test_set[,2:3])

In [58]:
training_set

  Country Age         Salary      Purchased
1 1        0.53010727  0.59264339 2
2 2       -1.77897208 -1.32872204 1
4 2       -0.28486191 -0.28798243 2
5 3       -0.01320552 -0.06560218 1
6 1       -0.69234650 -0.52815311 1
7 2       -0.17921776 -1.00849447 2
8 1        1.07342005  1.15304164 1
9 3        1.34507645  1.47326921 2